select Н_ОЦЕНКИ.ПРИМЕЧАНИЕ, Н_ВЕДОМОСТИ.ИД from Н_ОЦЕНКИ LEFT JOIN Н_ВЕДОМОСТИ
ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА
WHERE Н_ОЦЕНКИ.КОД = '4' AND Н_ВЕДОМОСТИ.ИД = 1250972;




SELECT Н_ЛЮДИ.ИД, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ИД
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ИД
WHERE Н_ЛЮДИ.ОТЧЕСТВО > 'Георгиевич' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 163484 AND Н_УЧЕНИКИ.ИД = 150308;

CREATE INDEX "ИНД_ОЦЕНКИ_КОД" ON "Н_ОЦЕНКИ" USING BTREE("КОД");
CREATE INDEX "ИНД_ВЕДОМОСТИ_ИД" ON "Н_ВЕДОМОСТИ" USING BTREE("ИД");
CREATE INDEX "ИНД_ВЕДОМОСТИ_ОЦЕНКА" ON "Н_ВЕДОМОСТИ" USING HASH("ОЦЕНКА");

CREATE INDEX "ИНД_ЛЮДИ_ОТЧЕСТВО" ON "Н_ЛЮДИ" USING BTREE("ОТЧЕСТВО);
CREATE INDEX "ИНД_ОБУЧЕНИЯ_ЧЛВК_ИД" ON "Н_ОБУЧЕНИЯ" USING HASH("ЧЛВК_ИД);
CREATE INDEX "ИНД_УЧЕНИКИ_ИД" ON "Н_УЧЕНИКИ" USING HASH("ИД");