Запрос 1:
SELECT Н_ОЦЕНКИ.ПРИМЕЧАНИЕ, Н_ВЕДОМОСТИ.ЧЛВК_ИД 
FROM Н_ОЦЕНКИ 
RIGHT JOIN Н_ВЕДОМОСТИ 
ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА 
WHERE Н_ОЦЕНКИ.КОД = '5' AND Н_ВЕДОМОСТИ.ИД = 1426978;
У этой ведомости оценка не 5 => ничего не выведет

Запрос 2:
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ИД
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ОТЧЕСТВО < 'Сергеевич' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 105590 AND Н_УЧЕНИКИ.НАЧАЛО > '2009-02-09';

Доказательсво, что выводится пустота:
SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.НЗК
FROM Н_ЛЮДИ
LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ОТЧЕСТВО < 'Сергеевич' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 105590;


SELECT Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ИД
FROM Н_ОБУЧЕНИЯ
LEFT JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 105590 AND Н_УЧЕНИКИ.НАЧАЛО > '2009-02-09';


Запрос 3:
SELECT COUNT(*) AS num_people
FROM Н_ЛЮДИ
INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
INNER JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE ОТЧЕСТВО IS NULL AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';


Запрос 4:
SELECT ГРУППА
FROM Н_УЧЕНИКИ
WHERE Н_УЧЕНИКИ.ПЛАН_ИД IN (
    SELECT Н_ПЛАНЫ.ИД
    FROM Н_ПЛАНЫ
             JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ' AND Н_ПЛАНЫ.УЧЕБНЫЙ_ГОД = '2010/2011'
)
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING COUNT(Н_УЧЕНИКИ.ЧЛВК_ИД) > 10;


Запрос 5:
SELECT "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", AVG(CASE WHEN ("ОЦЕНКА" <> 'зачет' AND "ОЦЕНКА" <> 'осв' AND "ОЦЕНКА" <> 'незач' AND "ОЦЕНКА" <> 'неявка') THEN CAST("ОЦЕНКА" AS INTEGER) END) AS "СР_ОЦЕНКА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
FROM "Н_ВЕДОМОСТИ"
JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
JOIN "Н_ЛЮДИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "ГРУППА" = '4100'
GROUP BY "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
HAVING AVG(CASE
    WHEN ("ОЦЕНКА" <> 'зачет'
                          AND "ОЦЕНКА" <> 'осв'
                          AND "ОЦЕНКА" <> 'незач'
                          AND "ОЦЕНКА" <> 'неявка')
        THEN CAST("ОЦЕНКА" AS INTEGER)
    END) >= (
    SELECT min(CASE WHEN ("ОЦЕНКА" <> 'зачет' AND "ОЦЕНКА" <> 'осв' AND "ОЦЕНКА" <> 'незач' AND "ОЦЕНКА" <> 'неявка') THEN CAST("ОЦЕНКА" AS INTEGER) END)
    FROM "Н_ВЕДОМОСТИ"
             JOIN "Н_УЧЕНИКИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3100'
);

Запрос 6:
SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ПЛАНЫ"."НОМЕР", "Н_УЧЕНИКИ"."СОСТОЯНИЕ"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
WHERE "Н_УЧЕНИКИ"."ПЛАН_ИД" IN(
    SELECT "Н_ПЛАНЫ"."ИД"
    FROM "Н_ПЛАНЫ"
    WHERE "Н_ПЛАНЫ"."КУРС" = 1 AND ("Н_ПЛАНЫ"."ФО_ИД" = 1 OR "Н_ПЛАНЫ"."ФО_ИД" = 3) AND DATE("Н_ПЛАНЫ"."ДАТА_УТВЕРЖДЕНИЯ") > '2012-09-01'
)
GROUP BY "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ПЛАНЫ"."НОМЕР", "Н_УЧЕНИКИ"."СОСТОЯНИЕ";
Пустой, потому что данные только до 2011 года => заведомо нечего возвращать.

Запрос 7:
SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ФАМИЛИЯ"
FROM "Н_ЛЮДИ"
WHERE "Н_ЛЮДИ"."ИД" != ANY(SELECT "ЧЛВК_ИД" FROM "Н_УЧЕНИКИ")
GROUP BY "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ФАМИЛИЯ";
